# Does using prior SQL queries help? 
In this workbook, we evalaute the effect of using "prior sql logs" in LLM prompts. For that, we will amend each table schema with the prior queries run on them. We need remove the query that is tested from the so called log.

In [1]:
import pandas as pd
import tensorflow_hub as hub
import numpy as np
import altair as alt
from openai import OpenAI
from sql_metadata import Parser
import os
from IPython.display import display, Markdown
from collections import defaultdict

In [26]:
df_q = pd.read_json('data/queries.json')

In [27]:
df_q

,question,sql,original_sql,tables_referred
0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count...","SELECT department_id, COUNT(*) AS course_count...",[CIS_COURSE_CATALOG]
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_...","select distinct subject_title, effective_term_...","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...,select max(cnt) from (select count(*) as cnt f...,[FCLT_BUILDING_ADDRESS_HIST]
5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...,select avg(cnt) from (select count(*) as cnt f...,"[MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]"
6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...,select distinct empl.full_name from mit_studen...,"[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]"
7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -...","select distinct subject_title, term_end_date-t...","[ACADEMIC_TERMS, CIS_COURSE_CATALOG]"
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM fac_buildi...","SELECT fb.building_name, fba.* FROM fac_buildi...","[FAC_BUILDING, FAC_BUILDING_ADDRESS]"
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,select count(*) from mit_student_directory;,[MIT_STUDENT_DIRECTORY]
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...,select distinct library_material_status from l...,"[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]"
11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...,select distinct city_name from zip_usa union s...,"[ZIP_USA, ZIP_CANADA]"
12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...,select avg(offered_subject_nr) from (select di...,[SUBJECT_OFFERED]
13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","[FCLT_ROOMS, FCLT_BUILDING]"
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","[SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]"
15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...,select count(*) from cis_course_catalog where ...,[CIS_COURSE_CATALOG]
16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,[CIS_COURSE_CATALOG]
17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO...","select Room, floor, fac_building_address.* fro...",[EMPLOYEE_DIRECTORY]
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC...","select distinct MIT_ID, employee.* from(select...",[EMPLOYEE_DIRECTORY]
19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl...","select distinct se.subject_id, se.subject_titl...","[SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]"
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI...","select department_name, count(*) over (partiti...",[MIT_STUDENT_DIRECTORY]
21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,select distinct IAP_CATEGORY_NAME from IAP_SUB...,[IAP_SUBJECT_CATEGORY]
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n...","select count(*) from( (select zip_code, city_n...","[ZIP_USA, ZIP_CANADA]"
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...,select count(distinct MIT_ID) from employee_di...,[EMPLOYEE_DIRECTORY]
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_...","select distinct school_name, count(department_...",[STUDENT_DEPARTMENT]
25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM...","select full_name, krb_name, email_address from...",[EMPLOYEE_DIRECTORY]
26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...,select * from (select * from(select distinct s...,[STUDENT_DEPARTMENT]
27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ...","select * from COURSE_CATALOG_SUBJECT_OFFERED, ...",[COURSE_CATALOG_SUBJECT_OFFERED]
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...,select * from top_level_domain where top_level...,[TOP_LEVEL_DOMAIN]
29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ...","select disitcnt * from( select subject_title, ...","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM..."
30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_...","select distinct subject_title, form_type, num_...",[SUBJECT_OFFERED]
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*...","select * from (select c.title, c.isbn, count(*...","[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]"
32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati...","select distinct activity_title, session_locati...","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE..."
33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F...","select distinct title, isbn, new_shelf_price f...",[TIP_MATERIAL]
34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a...","select subject_title from subject_summary c, a...","[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]"
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ...","select count(*) (select department_name, count...",[MIT_STUDENT_DIRECTORY]
36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,"[SE_PERSON, EMPLOYEE_DIRECTORY]"

In [28]:
tables = []
for q in df_q['sql']: 
    t = Parser(q).tables
    tables.append([v.upper() for v in t])
df_q['tables'] = tables

In [29]:
unique_tables = set()
for  l in tables: 
    for t in l:
        unique_tables.add(t.upper())

In [30]:
len(unique_tables)

31

In [31]:
unique_tables

{'ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'EMPLOYEE_DIRECTORY',
 'FAC_BUILDING',
 'FAC_BUILDING_ADDRESS',
 'FCLT_BUILDING',
 'FCLT_BUILDING_ADDRESS_HIST',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_MATERIAL_STATUS',
 'MIT_STUDENT_DIRECTORY',
 'SE_PERSON',
 'SPACE_UNIT',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'ZIP_CANADA',
 'ZIP_USA'}

In [32]:
df_q

,question,sql,original_sql,tables_referred,tables
0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]","[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]","[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count...","SELECT department_id, COUNT(*) AS course_count...",[CIS_COURSE_CATALOG],[CIS_COURSE_CATALOG]
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_...","select distinct subject_title, effective_term_...","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...,select max(cnt) from (select count(*) as cnt f...,[FCLT_BUILDING_ADDRESS_HIST],[FCLT_BUILDING_ADDRESS_HIST]
5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...,select avg(cnt) from (select count(*) as cnt f...,"[MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]","[MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]"
6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...,select distinct empl.full_name from mit_studen...,"[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]","[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]"
7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -...","select distinct subject_title, term_end_date-t...","[ACADEMIC_TERMS, CIS_COURSE_CATALOG]","[ACADEMIC_TERMS, CIS_COURSE_CATALOG]"
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM fac_buildi...","SELECT fb.building_name, fba.* FROM fac_buildi...","[FAC_BUILDING, FAC_BUILDING_ADDRESS]","[FAC_BUILDING, FAC_BUILDING_ADDRESS]"
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,select count(*) from mit_student_directory;,[MIT_STUDENT_DIRECTORY],[MIT_STUDENT_DIRECTORY]
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...,select distinct library_material_status from l...,"[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]","[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]"
11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...,select distinct city_name from zip_usa union s...,"[ZIP_USA, ZIP_CANADA]","[ZIP_USA, ZIP_CANADA]"
12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...,select avg(offered_subject_nr) from (select di...,[SUBJECT_OFFERED],[SUBJECT_OFFERED]
13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","[FCLT_ROOMS, FCLT_BUILDING]","[FCLT_ROOMS, FCLT_BUILDING]"
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","[SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]","[SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]"
15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...,select count(*) from cis_course_catalog where ...,[CIS_COURSE_CATALOG],[CIS_COURSE_CATALOG]
16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,[CIS_COURSE_CATALOG],[CIS_COURSE_CATALOG]
17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO...","select Room, floor, fac_building_address.* fro...",[EMPLOYEE_DIRECTORY],[EMPLOYEE_DIRECTORY]
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC...","select distinct MIT_ID, employee.* from(select...",[EMPLOYEE_DIRECTORY],[EMPLOYEE_DIRECTORY]
19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl...","select distinct se.subject_id, se.subject_titl...","[SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]","[SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]"
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI...","select department_name, count(*) over (partiti...",[MIT_STUDENT_DIRECTORY],[MIT_STUDENT_DIRECTORY]
21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,select distinct IAP_CATEGORY_NAME from IAP_SUB...,[IAP_SUBJECT_CATEGORY],[IAP_SUBJECT_CATEGORY]
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n...","select count(*) from( (select zip_code, city_n...","[ZIP_USA, ZIP_CANADA]","[ZIP_USA, ZIP_CANADA]"
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...,select count(distinct MIT_ID) from employee_di...,[EMPLOYEE_DIRECTORY],[EMPLOYEE_DIRECTORY]
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_...","select distinct school_name, count(department_...",[STUDENT_DEPARTMENT],[STUDENT_DEPARTMENT]
25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM...","select full_name, krb_name, email_address from...",[EMPLOYEE_DIRECTORY],[EMPLOYEE_DIRECTORY]
26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...,select * from (select * from(select distinct s...,[STUDENT_DEPARTMENT],[STUDENT_DEPARTMENT]
27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ...","select * from COURSE_CATALOG_SUBJECT_OFFERED, ...",[COURSE_CATALOG_SUBJECT_OFFERED],[COURSE_CATALOG_SUBJECT_OFFERED]
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...,select * from top_level_domain where top_level...,[TOP_LEVEL_DOMAIN],[TOP_LEVEL_DOMAIN]
29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ...","select disitcnt * from( select subject_title, ...","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM...","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM..."
30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_...","select distinct subject_title, form_type, num_...",[SUBJECT_OFFERED],[SUBJECT_OFFERED]
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*...","select * from (select c.title, c.isbn, count(*...","[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]","[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]"
32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati...","select distinct activity_title, session_locati...","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE...","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE..."
33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F...","select distinct title, isbn, new_shelf_price f...",[TIP_MATERIAL],[TIP_MATERIAL]
34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a...","select subject_title from subject_summary c, a...","[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]","[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]"
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ...","select count(*) (select department_name, count...",[MIT_STUDENT_DIRECTORY],[MIT_STUDENT_DIRECTORY]
36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,"[SE_PERSON, EMPLOYEE_DIRECTORY]","[SE_PERSON, EMPLOYEE_DIRECTORY]"

In [33]:
df_x = pd.read_json('data/queries.json')

In [34]:
df_x['tables_referred']

0                        [HR_ORG_UNIT_NEW, HR_ORG_UNIT]
1                        [HR_ORG_UNIT_NEW, HR_ORG_UNIT]
2                                  [CIS_COURSE_CATALOG]
3                  [CIS_COURSE_CATALOG, ACADEMIC_TERMS]
4                          [FCLT_BUILDING_ADDRESS_HIST]
5           [MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]
6           [MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]
7                  [ACADEMIC_TERMS, CIS_COURSE_CATALOG]
8                  [FAC_BUILDING, FAC_BUILDING_ADDRESS]
9                               [MIT_STUDENT_DIRECTORY]
10       [LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]
11                                [ZIP_USA, ZIP_CANADA]
12                                    [SUBJECT_OFFERED]
13                          [FCLT_ROOMS, FCLT_BUILDING]
14              [SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]
15                                 [CIS_COURSE_CATALOG]
16                                 [CIS_COURSE_CATALOG]
17                                 [EMPLOYEE_DIRECTORY]
18                                 [EMPLOYEE_DIRECTORY]
19                [SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]
20                              [MIT_STUDENT_DIRECTORY]
21                               [IAP_SUBJECT_CATEGORY]
22                                [ZIP_USA, ZIP_CANADA]
23                                 [EMPLOYEE_DIRECTORY]
24                                 [STUDENT_DEPARTMENT]
25                                 [EMPLOYEE_DIRECTORY]
26                                 [STUDENT_DEPARTMENT]
27                     [COURSE_CATALOG_SUBJECT_OFFERED]
28                                   [TOP_LEVEL_DOMAIN]
29    [COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM...
30                                    [SUBJECT_OFFERED]
31      [TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]
32    [IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE...
33                                       [TIP_MATERIAL]
34                [SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]
35                              [MIT_STUDENT_DIRECTORY]
36                      [SE_PERSON, EMPLOYEE_DIRECTORY]
Name: tables_referred, dtype: object

In [23]:
unique_tables

{'ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'EMPLOYEE_DIRECTORY',
 'FAC_BUILDING',
 'FAC_BUILDING_ADDRESS',
 'FCLT_BUILDING',
 'FCLT_BUILDING_ADDRESS_HIST',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_MATERIAL_STATUS',
 'MIT_STUDENT_DIRECTORY',
 'SE_PERSON',
 'SPACE_UNIT',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'ZIP_CANADA',
 'ZIP_USA'}

In [35]:
unique_tables

{'ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'EMPLOYEE_DIRECTORY',
 'FAC_BUILDING',
 'FAC_BUILDING_ADDRESS',
 'FCLT_BUILDING',
 'FCLT_BUILDING_ADDRESS_HIST',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_MATERIAL_STATUS',
 'MIT_STUDENT_DIRECTORY',
 'SE_PERSON',
 'SPACE_UNIT',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'ZIP_CANADA',
 'ZIP_USA'}

In [36]:
len(unique_tables)

31

## Map tables to queries

In [42]:
queries = []
for t in unique_tables:
    q = set()
    for i, T in enumerate(df_q['tables_referred']): 
        if t in T: 
            q.add(i) 
    queries.append(list(q))

In [43]:
queries

[[3, 7],
 [13, 14],
 [32],
 [34, 19],
 [13, 14],
 [2, 3, 7, 15, 16],
 [35, 5, 6, 9, 20],
 [32],
 [10],
 [31],
 [11, 22],
 [0, 1],
 [31],
 [32, 34, 29],
 [36],
 [11, 22],
 [0, 1],
 [8],
 [4],
 [12, 30],
 [27, 29],
 [28],
 [33, 31],
 [10],
 [14],
 [36, 6, 17, 18, 23, 25],
 [21],
 [24, 26],
 [19, 5],
 [8],
 [32]]

In [44]:
df_t = pd.DataFrame(columns=['table', 'log'])

In [46]:
df_t['table'] = list(unique_tables)

In [48]:
df_t['log'] = queries

In [49]:
df_t

                             table                      log
0                   ACADEMIC_TERMS                   [3, 7]
1                       FCLT_ROOMS                 [13, 14]
2              IAP_SUBJECT_SESSION                     [32]
3                  SUBJECT_SUMMARY                 [34, 19]
4                    FCLT_BUILDING                 [13, 14]
5               CIS_COURSE_CATALOG        [2, 3, 7, 15, 16]
6            MIT_STUDENT_DIRECTORY        [35, 5, 6, 9, 20]
7               IAP_SUBJECT_DETAIL                     [32]
8              TIP_MATERIAL_STATUS                     [10]
9                       TIP_DETAIL                     [31]
10                      ZIP_CANADA                 [11, 22]
11                     HR_ORG_UNIT                   [0, 1]
12             TIP_SUBJECT_OFFERED                     [31]
13              ACADEMIC_TERMS_ALL             [32, 34, 29]
14                       SE_PERSON                     [36]
15                         ZIP_USA                 [11, 22]
16                 HR_ORG_UNIT_NEW                   [0, 1]
17            FAC_BUILDING_ADDRESS                      [8]
18      FCLT_BUILDING_ADDRESS_HIST                      [4]
19                 SUBJECT_OFFERED                 [12, 30]
20  COURSE_CATALOG_SUBJECT_OFFERED                 [27, 29]
21                TOP_LEVEL_DOMAIN                     [28]
22                    TIP_MATERIAL                 [33, 31]
23         LIBRARY_MATERIAL_STATUS                     [10]
24                      SPACE_UNIT                     [14]
25              EMPLOYEE_DIRECTORY  [36, 6, 17, 18, 23, 25]
26            IAP_SUBJECT_CATEGORY                     [21]
27              STUDENT_DEPARTMENT                 [24, 26]
28              SUBJECT_ENROLLABLE                  [19, 5]
29                    FAC_BUILDING                      [8]
30              IAP_SUBJECT_PERSON                     [32]

# Give ChatGPT the "database" schema as context and elicit its answer

## Build the schema prompt

In [122]:
def table_to_sql_create(t, l): 
    schema_file='data/views/schema_as_table/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t = pd.read_csv(schema_file)
        p = "CREATE TABLE " + t + "(\n"  
        p = p + '\n'.join(list(df_t[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
        if l:
            p = p + "\n ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE {0} **\n\n".format(t)
            for i in l: 
                # p = p + "QUESTION: {0} \n".format(df_q['question'][i])
                # p = p + "SQL ANSWER: {0} \n\n".format(df_q['sql'][i])
                p = p + "SQL: {0} \n\n".format(df_q['sql'][i])
    return p

In [123]:
def create_prompt(curr_query): 
    prompt = "*** ALL THE TABLES IN THE DATABASE and QUERY LOGS *** \n\n"
    cnt = 0 
    exclude = [curr_query]
    for i, t in enumerate(unique_tables):
        l = set(queries[i]).difference(exclude)
        p = table_to_sql_create(t, list(l))
        if not p:
            print(t)
        else: 
            cnt = cnt + 1
            prompt = prompt + p
            prompt = prompt + "\n\n"
    return prompt

In [124]:
key = os.environ['OPENAI_API_KEY']

In [125]:
len(unique_tables)

31

In [126]:
client = OpenAI(api_key=key)

In [127]:
gpt_sql_log = []
for i, q in enumerate(df_q['question']): 
    prompt = create_prompt(i)
    response = client.chat.completions.create(
      model="gpt-4",
      messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of the all the tables that you might need \
          for answering the user questions are given below. There are 31 tables in the database. \
          For each table, the schema of the table and the previous queries that referred to the table are also given. \
          \
          Reply with only the answer in SQL and include no linebreaks, newlines, escape characters or other commentary.\n\n" + prompt 
          # prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    gpt_sql_log.append(response.choices[0].message.content)

In [128]:
df_q['gpt_sql_log'] = gpt_sql_log

In [133]:
gpt_sql_log

['SELECT COUNT(*) FROM HR_ORG_UNIT_NEW MINUS SELECT COUNT(*) FROM HR_ORG_UNIT;',
 'SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_ORG_UNIT_ID NOT IN (SELECT HR_ORG_UNIT_ID FROM HR_ORG_UNIT)',
 'SELECT DEPARTMENT_CODE, COUNT(*) FROM CIS_COURSE_CATALOG GROUP BY DEPARTMENT_CODE',
 "SELECT * FROM ACADEMIC_TERMS WHERE TERM_STATUS_INDICATOR IN ('P', 'F', 'C')",
 'SELECT RESPONSIBLE_FACULTY_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS location_changes FROM EMPLOYEE_DIRECTORY GROUP BY RESPONSIBLE_FACULTY_NAME ORDER BY location_changes DESC LIMIT 1;',
 'SELECT AVG(NUM_ENROLLED_STUDENTS) FROM SUBJECT_OFFERED',
 "SELECT FULL_NAME FROM MIT_STUDENT_DIRECTORY WHERE DEPARTMENT = 'MIT'",
 "SELECT SUBJECT_TITLE, MIN(TERM_END_DATE - TERM_START_DATE) AS MINIMUM_DURATION FROM CIS_COURSE_CATALOG, ACADEMIC_TERMS WHERE CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS.TERM_CODE AND ACADEMIC_TERMS.IS_CURRENT_TERM = 'Y' AND CIS_COURSE_CATALOG.IS_OFFERED_THIS_YEAR = 'Y' GROUP BY SUBJECT_TITLE ORDER BY MINIMUM_DURATION ASC LIMIT 1",
 'SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FCLT_BUILDING JOIN FAC_BUILDING_ADDRESS ON FCLT_BUILDING.FCLT_BUILDING_KEY = FAC_BUILDING_ADDRESS.BUILDING_KEY',
 'SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY',
 'SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;',
 'SELECT DISTINCT CITY FROM ZIP_USA UNION SELECT DISTINCT CITY FROM ZIP_CANADA',
 'SELECT AVG(course_count) FROM (SELECT department_name, COUNT(*) AS course_count FROM CIS_COURSE_CATALOG GROUP BY department_name) WHERE course_count > 100',
 'SELECT BUILDING_ROOM, COUNT(*) AS ROOM_COUNT FROM FCLT_ROOMS GROUP BY BUILDING_ROOM',
 'SELECT FCLT_BUILDING_KEY, COUNT(SPACE_UNIT_KEY) AS NUMBER_OF_SPACE_UNITS FROM SPACE_UNIT GROUP BY FCLT_BUILDING_KEY',
 "SELECT SUBJECT_TITLE, TERM_START_DATE FROM CIS_COURSE_CATALOG INNER JOIN ACADEMIC_TERMS ON CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS.TERM_CODE WHERE SUBJECT_DESCRIPTION IN ('Regular', 'Initial')",
 'SELECT department_name, COUNT(*) as course_count FROM SUBJECT_OFFERED GROUP BY department_name ORDER BY course_count DESC LIMIT 3',
 "SELECT OFFICE_LOCATION FROM EMPLOYEE_DIRECTORY WHERE FULL_NAME='Michael Stonebraker';",
 'SELECT FULL_NAME FROM EMPLOYEE_DIRECTORY GROUP BY FULL_NAME HAVING COUNT(*) > 1',
 "SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE='Computer Science'",
 'SELECT DEPARTMENT, COUNT(*) AS STUDENT_COUNT FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT',
 'SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY',
 "SELECT CITY_NAME FROM ZIP_USA WHERE ZIP_CODE = '501' UNION SELECT CITY_NAME FROM ZIP_CANADA WHERE POSTAL_CODE = '501'",
 'SELECT COUNT(*) FROM EMPLOYEE_DIRECTORY',
 'SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_NAME) AS NUM_DEPARTMENTS FROM STUDENT_DEPARTMENT GROUP BY SCHOOL_NAME',
 "SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS FROM EMPLOYEE_DIRECTORY WHERE FIRST_NAME = 'Michael'",
 'SELECT SCHOOL_NAME, COUNT(DEPARTMENT_NAME) AS NUM_DEPARTMENTS FROM STUDENT_DEPARTMENT GROUP BY SCHOOL_NAME ORDER BY NUM_DEPARTMENTS DESC LIMIT 1',
 'SELECT SUBJECT_TITLE, MAX(TOTAL_UNITS) FROM SUBJECT_SUMMARY GROUP BY SUBJECT_TITLE;\n',
 "SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN_DESCRIPTION = 'Brazil';",
 "SELECT DISTINCT TERM_START_DATE FROM ACADEMIC_TERMS, CIS_COURSE_CATALOG WHERE TERM_CODE = EFFECTIVE_TERM_CODE AND DEPARTMENT_NAME = 'Computer Science' AND (TERM_END_DATE - TERM_START_DATE) < 100",
 'SELECT SUBJECT_ID, FORMAT FROM SUBJECT_SUMMARY WHERE SUBJECT_ENROLLMENT_NUMBER > 800',
 'SELECT TITLE, COUNT(*) AS COUNT FROM TIP_MATERIAL JOIN TIP_DETAIL ON TIP_MATERIAL.TIP_MATERIAL_KEY = TIP_DETAIL.TIP_MATERIAL_KEY GROUP BY TITLE ORDER BY COUNT DESC LIMIT 1',
 'SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME FROM IAP_SUBJECT_DETAIL INNER JOIN SUBJECT_OFFERED ON IAP_SUBJECT_DETAIL.IAP_SUBJECT_SESSION_KEY = SUBJECT_OFFERED.SUBJECT_KEY ORDER BY SESSION_DATE ASC',
 'SELECT TITLE, ISBN, NEW_SHELF_PRICE FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC',
 'SELECT SUBJECT_ID, SUBJECT_TITLE, MIN(WAREHOUSE_LOAD_DATE) AS First_Registered_Date FROM SUBJECT_ENROLLABLE GROUP BY SUBJECT_ID, SUBJECT_TITLE ORDER BY First_Registered_Date;',
 'SELECT COUNT(*) FROM (SELECT DEPARTMENT, COUNT(*) as num_students FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT) WHERE num_students < 300',
 'SELECT DEPARTMENT, COUNT(DISTINCT PAYROLL_RANK) AS RANK_COUNT FROM SE_PERSON GROUP BY DEPARTMENT ORDER BY RANK_COUNT DESC LIMIT 1']

In [134]:
df_q.to_csv("log-context-results.csv")

In [8]:
tables = []
for q in df_q['gpt_sql_log']: 
    t = Parser(q).tables
    tables.append([v.upper() for v in t])
df_q['gpt_sql_log_tables'] = tables

In [9]:
tables

[['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT'],
 ['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT'],
 ['CIS_COURSE_CATALOG'],
 ['ACADEMIC_TERMS'],
 ['EMPLOYEE_DIRECTORY'],
 ['SUBJECT_OFFERED'],
 ['MIT_STUDENT_DIRECTORY'],
 ['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS'],
 ['FCLT_BUILDING', 'FAC_BUILDING_ADDRESS'],
 ['MIT_STUDENT_DIRECTORY'],
 ['TIP_MATERIAL_STATUS'],
 ['ZIP_USA', 'ZIP_CANADA'],
 ['CIS_COURSE_CATALOG'],
 ['FCLT_ROOMS'],
 ['SPACE_UNIT'],
 ['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS'],
 ['SUBJECT_OFFERED'],
 ['EMPLOYEE_DIRECTORY'],
 ['EMPLOYEE_DIRECTORY'],
 ['SUBJECT_ENROLLABLE'],
 ['MIT_STUDENT_DIRECTORY'],
 ['IAP_SUBJECT_CATEGORY'],
 ['ZIP_USA', 'ZIP_CANADA'],
 ['EMPLOYEE_DIRECTORY'],
 ['STUDENT_DEPARTMENT'],
 ['EMPLOYEE_DIRECTORY'],
 ['STUDENT_DEPARTMENT'],
 ['SUBJECT_SUMMARY'],
 ['TOP_LEVEL_DOMAIN'],
 ['ACADEMIC_TERMS', 'CIS_COURSE_CATALOG'],
 ['SUBJECT_SUMMARY'],
 ['TIP_MATERIAL', 'TIP_DETAIL'],
 ['IAP_SUBJECT_DETAIL', 'SUBJECT_OFFERED'],
 ['TIP_MATERIAL'],
 ['SUBJECT_ENROLLABLE'],
 ['MIT_STUDENT_DIRECTORY'],
 ['SE_PERSON']]

In [2]:
df_q = pd.read_csv("log-context-results.csv")

In [18]:
df_q

,Unnamed: 0,question,sql,original_sql,tables_referred,tables,gpt_sql_log,gpt_sql_log_tables
0,0,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']","['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM HR_ORG_UNIT_NEW MINUS SEL...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
1,1,How many organisation units in human resources...,SELECT COUNT(*) FROM (SELECT hr_org_unit_key F...,SELECT count(*) from (select hr_org_unit_key f...,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']","['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_...,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
2,2,Count the number of courses offered by each de...,"SELECT department_id, COUNT(*) AS course_count...","SELECT department_id, COUNT(*) AS course_count...",['CIS_COURSE_CATALOG'],['CIS_COURSE_CATALOG'],"SELECT DEPARTMENT_CODE, COUNT(*) FROM CIS_COUR...",[CIS_COURSE_CATALOG]
3,3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, effective_term_...","select distinct subject_title, effective_term_...","['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS']","['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS']",SELECT * FROM ACADEMIC_TERMS WHERE TERM_STATUS...,[ACADEMIC_TERMS]
4,4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt F...,select max(cnt) from (select count(*) as cnt f...,['FCLT_BUILDING_ADDRESS_HIST'],['FCLT_BUILDING_ADDRESS_HIST'],"SELECT RESPONSIBLE_FACULTY_NAME, COUNT(DISTINC...",[EMPLOYEE_DIRECTORY]
5,5,What is the average number of courses a studen...,SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt F...,select avg(cnt) from (select count(*) as cnt f...,"['MIT_STUDENT_DIRECTORY', 'SUBJECT_ENROLLABLE']","['MIT_STUDENT_DIRECTORY', 'SUBJECT_ENROLLABLE']",SELECT AVG(NUM_ENROLLED_STUDENTS) FROM SUBJECT...,[SUBJECT_OFFERED]
6,6,Which students are employed by mit?,SELECT DISTINCT empl.full_name FROM mit_studen...,select distinct empl.full_name from mit_studen...,"['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY']","['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY']",SELECT FULL_NAME FROM MIT_STUDENT_DIRECTORY WH...,[MIT_STUDENT_DIRECTORY]
7,7,What is the shortest course available this sem...,"SELECT DISTINCT subject_title, term_end_date -...","select distinct subject_title, term_end_date-t...","['ACADEMIC_TERMS', 'CIS_COURSE_CATALOG']","['ACADEMIC_TERMS', 'CIS_COURSE_CATALOG']","SELECT SUBJECT_TITLE, MIN(TERM_END_DATE - TERM...","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]"
8,8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM fac_buildi...","SELECT fb.building_name, fba.* FROM fac_buildi...","['FAC_BUILDING', 'FAC_BUILDING_ADDRESS']","['FAC_BUILDING', 'FAC_BUILDING_ADDRESS']","SELECT BUILDING_NAME_LONG, STREET_NUMBER, STRE...","[FCLT_BUILDING, FAC_BUILDING_ADDRESS]"
9,9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,select count(*) from mit_student_directory;,['MIT_STUDENT_DIRECTORY'],['MIT_STUDENT_DIRECTORY'],SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY,[MIT_STUDENT_DIRECTORY]
10,10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM l...,select distinct library_material_status from l...,"['LIBRARY_MATERIAL_STATUS', 'TIP_MATERIAL_STAT...","['LIBRARY_MATERIAL_STATUS', 'TIP_MATERIAL_STAT...",SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_M...,[TIP_MATERIAL_STATUS]
11,11,What are the different cities where people live?,SELECT DISTINCT city_name FROM zip_usa UNION S...,select distinct city_name from zip_usa union s...,"['ZIP_USA', 'ZIP_CANADA']","['ZIP_USA', 'ZIP_CANADA']",SELECT DISTINCT CITY FROM ZIP_USA UNION SELECT...,"[ZIP_USA, ZIP_CANADA]"
12,12,Give the average number of courses in one depa...,SELECT AVG(offered_subject_nr) FROM (SELECT DI...,select avg(offered_subject_nr) from (select di...,['SUBJECT_OFFERED'],['SUBJECT_OFFERED'],SELECT AVG(course_count) FROM (SELECT departme...,[CIS_COURSE_CATALOG]
13,13,Count the number of room in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","['FCLT_ROOMS', 'FCLT_BUILDING']","['FCLT_ROOMS', 'FCLT_BUILDING']","SELECT BUILDING_ROOM, COUNT(*) AS ROOM_COUNT F...",[FCLT_ROOMS]
14,14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) O...","select distinct BUILDING_NAME_LONG, count(*) o...","['SPACE_UNIT', 'FCLT_ROOMS', 'FCLT_BUILDING']","['SPACE_UNIT', 'FCLT_ROOMS', 'FCLT_BUILDING']","SELECT FCLT_BUILDING_KEY, COUNT(SPACE_UNIT_KEY...",[SPACE_UNIT]
15,15,For courses that have descriptions of Regular ...,SELECT COUNT(*) FROM cis_course_catalog WHERE ...,select count(*) from cis_course_catalog where ...,['CIS_COURSE_CATALOG'],['CIS_COURSE_CATALOG'],"SELECT SUBJECT_TITLE, TERM_START_DATE FROM CIS...","[CIS_COURSE_CATALOG, ACADEMIC_TERMS]"
16,16,What are the names of the 3 departments which ...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,['CIS_COURSE_CATALOG'],['CIS_COURSE_CATALOG'],"SELECT department_name, COUNT(*) as course_cou...",[SUBJECT_OFFERED]
17,17,Where is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FRO...","select Room, floor, fac_building_address.* fro...",['EMPLOYEE_DIRECTORY'],['EMPLOYEE_DIRECTORY'],SELECT OFFICE_LOCATION FROM EMPLOYEE_DIRECTORY...,[EMPLOYEE_DIRECTORY]
18,18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELEC...","select distinct MIT_ID, employee.* from(select...",['EMPLOYEE_DIRECTORY'],['EMPLOYEE_DIRECTORY'],SELECT FULL_NAME FROM EMPLOYEE_DIRECTORY GROUP...,[EMPLOYEE_DIRECTORY]
19,19,Show the name for subjects which are enrollabl...,"SELECT DISTINCT se.subject_id, se.subject_titl...","select distinct se.subject_id, se.subject_titl...","['SUBJECT_SUMMARY', 'SUBJECT_ENROLLABLE']","['SUBJECT_SUMMARY', 'SUBJECT_ENROLLABLE']",SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENR...,[SUBJECT_ENROLLABLE]
20,20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITI...","select department_name, count(*) over (partiti...",['MIT_STUDENT_DIRECTORY'],['MIT_STUDENT_DIRECTORY'],"SELECT DEPARTMENT, COUNT(*) AS STUDENT_COUNT F...",[MIT_STUDENT_DIRECTORY]
21,21,What categories are there for independent acti...,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,select distinct IAP_CATEGORY_NAME from IAP_SUB...,['IAP_SUBJECT_CATEGORY'],['IAP_SUBJECT_CATEGORY'],SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUB...,[IAP_SUBJECT_CATEGORY]
22,22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_n...","select count(*) from( (select zip_code, city_n...","['ZIP_USA', 'ZIP_CANADA']","['ZIP_USA', 'ZIP_CANADA']",SELECT CITY_NAME FROM ZIP_USA WHERE ZIP_CODE =...,"[ZIP_USA, ZIP_CANADA]"
23,23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_di...,select count(distinct MIT_ID) from employee_di...,['EMPLOYEE_DIRECTORY'],['EMPLOYEE_DIRECTORY'],SELECT COUNT(*) FROM EMPLOYEE_DIRECTORY,[EMPLOYEE_DIRECTORY]
24,24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_...","select distinct school_name, count(department_...",['STUDENT_DEPARTMENT'],['STUDENT_DEPARTMENT'],"SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_...",[STUDENT_DEPARTMENT]
25,25,"Show the name, kerberos credentials, and email...","SELECT full_name, krb_name, email_address FROM...","select full_name, krb_name, email_address from...",['EMPLOYEE_DIRECTORY'],['EMPLOYEE_DIRECTORY'],"SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS FROM...",[EMPLOYEE_DIRECTORY]
26,26,Show the school with the largest number of dep...,SELECT * FROM (SELECT * FROM (SELECT DISTINCT ...,select * from (select * from(select distinct s...,['STUDENT_DEPARTMENT'],['STUDENT_DEPARTMENT'],"SELECT SCHOOL_NAME, COUNT(DEPARTMENT_NAME) AS ...",[STUDENT_DEPARTMENT]
27,27,What are the courses with the maximum number o...,"SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED, ...","select * from COURSE_CATALOG_SUBJECT_OFFERED, ...",['COURSE_CATALOG_SUBJECT_OFFERED'],['COURSE_CATALOG_SUBJECT_OFFERED'],"SELECT SUBJECT_TITLE, MAX(TOTAL_UNITS) FROM SU...",[SUBJECT_SUMMARY]
28,28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level...,select * from top_level_domain where top_level...,['TOP_LEVEL_DOMAIN'],['TOP_LEVEL_DOMAIN'],SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN ...,[TOP_LEVEL_DOMAIN]
29,29,What are all the different start dates of cour...,"SELECT DISTINCT * FROM (SELECT subject_title, ...","select disitcnt * from( select subject_title, ...","['COURSE_CATALOG_SUBJECT_OFFERED', 'ACADEMIC_T...","['COURSE_CATALOG_SUBJECT_OFFERED', 'ACADEMIC_T...",SELECT DISTINCT TERM_START_DATE FROM ACADEMIC_...,"[ACADEMIC_TERMS, CIS_COURSE_CATALOG]"
30,30,List the courses and format for all courses th...,"SELECT DISTINCT subject_title, form_type, num_...","select distinct subject_title, form_type, num_...",['SUBJECT_OFFERED'],['SUBJECT_OFFERED'],"SELECT SUBJECT_ID, FORMAT FROM SUBJECT_SUMMARY...",[SUBJECT_SUMMARY]
31,31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT c.title, c.isbn, COUNT(*...","select * from (select c.title, c.isbn, count(*...","['TIP_DETAIL', 'TIP_SUBJECT_OFFERED', 'TIP_MAT...","['TIP_DETAIL', 'TIP_SUBJECT_OFFERED', 'TIP_MAT...","SELECT TITLE, COUNT(*) AS COUNT FROM TIP_MATER...","[TIP_MATERIAL, TIP_DETAIL]"
32,32,"Show activity title, location, and supervisor ...","SELECT DISTINCT activity_title, session_locati...","select distinct activity_title, session_locati...","['IAP_SUBJECT_DETAIL', 'IAP_SUBJECT_PERSON', '...","['IAP_SUBJECT_DETAIL', 'IAP_SUBJECT_PERSON', '...","SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPO...","[IAP_SUBJECT_DETAIL, SUBJECT_OFFERED]"
33,33,What are the titles and isbn numbers for all m...,"SELECT DISTINCT title, isbn, new_shelf_price F...","select distinct title, isbn, new_shelf_price f...",['TIP_MATERIAL'],['TIP_MATERIAL'],"SELECT TITLE, ISBN, NEW_SHELF_PRICE FROM TIP_M...",[TIP_MATERIAL]
34,34,Which were the first registered subjects?,"SELECT subject_title FROM subject_summary c, a...","select subject_title from subject_summary c, a...","['SUBJECT_SUMMARY', 'ACADEMIC_TERMS_ALL']","['SUBJECT_SUMMARY', 'ACADEMIC_TERMS_ALL']","SELECT SUBJECT_ID, SUBJECT_TITLE, MIN(WAREHOUS...",[SUBJECT_ENROLLABLE]
35,35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT department_name, ...","select count(*) (select department_name, count...",['MIT_STUDENT_DIRECTORY'],['MIT_STUDENT_DIRECTORY'],"SELECT COUNT(*) FROM (SELECT DEPARTMENT, COUNT...",[MIT_STUDENT_DIRECTORY]
36,36,Which department has the most kinds of payroll...,SELECT * FROM (SELECT DISTINCT department_name...,select * from (select distinct department_name...,"['SE_PERSON', 'EMPLOYEE_DIRECTORY']","['SE_PERSON', 'EMPLOYEE_DIRECTORY']","SELECT DEPARTMENT, COUNT(DISTINCT PAYROLL_RANK...",[SE_PERSON]

In [32]:
accuracy = [] 
for i, t in enumerate(df_q['tables']):
    accuracy.append(len(set(t).intersection(df_q['gpt_sql_log_tables'][i]))/len(t))

In [33]:
df_q['tables']

0                        [HR_ORG_UNIT_NEW, HR_ORG_UNIT]
1                        [HR_ORG_UNIT_NEW, HR_ORG_UNIT]
2                                  [CIS_COURSE_CATALOG]
3                  [CIS_COURSE_CATALOG, ACADEMIC_TERMS]
4                          [FCLT_BUILDING_ADDRESS_HIST]
5           [MIT_STUDENT_DIRECTORY, SUBJECT_ENROLLABLE]
6           [MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]
7                  [ACADEMIC_TERMS, CIS_COURSE_CATALOG]
8                  [FAC_BUILDING, FAC_BUILDING_ADDRESS]
9                               [MIT_STUDENT_DIRECTORY]
10       [LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]
11                                [ZIP_USA, ZIP_CANADA]
12                                    [SUBJECT_OFFERED]
13                          [FCLT_ROOMS, FCLT_BUILDING]
14              [SPACE_UNIT, FCLT_ROOMS, FCLT_BUILDING]
15                                 [CIS_COURSE_CATALOG]
16                                 [CIS_COURSE_CATALOG]
17                                 [EMPLOYEE_DIRECTORY]
18                                 [EMPLOYEE_DIRECTORY]
19                [SUBJECT_SUMMARY, SUBJECT_ENROLLABLE]
20                              [MIT_STUDENT_DIRECTORY]
21                               [IAP_SUBJECT_CATEGORY]
22                                [ZIP_USA, ZIP_CANADA]
23                                 [EMPLOYEE_DIRECTORY]
24                                 [STUDENT_DEPARTMENT]
25                                 [EMPLOYEE_DIRECTORY]
26                                 [STUDENT_DEPARTMENT]
27                     [COURSE_CATALOG_SUBJECT_OFFERED]
28                                   [TOP_LEVEL_DOMAIN]
29    [COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERM...
30                                    [SUBJECT_OFFERED]
31      [TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]
32    [IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADE...
33                                       [TIP_MATERIAL]
34                [SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]
35                              [MIT_STUDENT_DIRECTORY]
36                      [SE_PERSON, EMPLOYEE_DIRECTORY]
Name: tables, dtype: object

In [48]:
accuracy

[1.0,
 1.0,
 1.0,
 0.5,
 0.0,
 0.0,
 0.5,
 1.0,
 0.5,
 1.0,
 0.5,
 1.0,
 0.0,
 0.5,
 0.3333333333333333,
 1.0,
 0.0,
 1.0,
 1.0,
 0.5,
 1.0,
 1.0,
 1.0,
 1.0,
 1.0,
 1.0,
 1.0,
 0.0,
 1.0,
 0.0,
 0.0,
 0.6666666666666666,
 0.25,
 1.0,
 0.0,
 1.0,
 0.5]

In [62]:
list(df_q['sql'][np.array(accuracy)==0.5])

["SELECT DISTINCT subject_title, effective_term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM cis_course_catalog, academic_terms WHERE effective_term_code = term_code;",
 'SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;',
 'SELECT fb.building_name, fba.* FROM fac_building fb INNER JOIN fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;',
 'SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;',
 'SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;',
 "SELECT DISTINCT se.subject_id, se.subject_title FROM subject_summary su, subject_enrollable se WHERE se.subject_id = su.subject_id AND department_name = 'Electrical Eng & Computer Sci';",
 'SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;']

In [63]:
list(df_q['question'][np.array(accuracy)==0.5])

['What are the past, upcoming, and current courses?',
 'Which students are employed by mit?',
 'Show buildings and their address.',
 'Show all statuses for materials?',
 'Count the number of room in a building.',
 'Show the name for subjects which are enrollable for Computer Science Student.',
 'Which department has the most kinds of payroll ranks?']

In [64]:
list(df_q['tables'][np.array(accuracy)==0.5])

[['CIS_COURSE_CATALOG', 'ACADEMIC_TERMS'],
 ['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY'],
 ['FAC_BUILDING', 'FAC_BUILDING_ADDRESS'],
 ['LIBRARY_MATERIAL_STATUS', 'TIP_MATERIAL_STATUS'],
 ['FCLT_ROOMS', 'FCLT_BUILDING'],
 ['SUBJECT_SUMMARY', 'SUBJECT_ENROLLABLE'],
 ['SE_PERSON', 'EMPLOYEE_DIRECTORY']]

In [65]:
list(df_q['gpt_sql_log_tables'][np.array(accuracy)==0.5])

[['ACADEMIC_TERMS'],
 ['MIT_STUDENT_DIRECTORY'],
 ['FCLT_BUILDING', 'FAC_BUILDING_ADDRESS'],
 ['TIP_MATERIAL_STATUS'],
 ['FCLT_ROOMS'],
 ['SUBJECT_ENROLLABLE'],
 ['SE_PERSON']]

In [53]:
list(df_q['question'][np.array(accuracy)==0.5])

['What are the past, upcoming, and current courses?',
 'Which students are employed by mit?',
 'Show buildings and their address.',
 'Show all statuses for materials?',
 'Count the number of room in a building.',
 'Show the name for subjects which are enrollable for Computer Science Student.',
 'Which department has the most kinds of payroll ranks?']

In [55]:
list(df_q['sql'][np.array(accuracy)==0.5])

["SELECT DISTINCT subject_title, effective_term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM cis_course_catalog, academic_terms WHERE effective_term_code = term_code;",
 'SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;',
 'SELECT fb.building_name, fba.* FROM fac_building fb INNER JOIN fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;',
 'SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;',
 'SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;',
 "SELECT DISTINCT se.subject_id, se.subject_title FROM subject_summary su, subject_enrollable se WHERE se.subject_id = su.subject_id AND department_name = 'Electrical Eng & Computer Sci';",
 'SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;']

In [57]:
list(df_q['gpt_sql_log'][np.array(accuracy)==0.5])

["SELECT * FROM ACADEMIC_TERMS WHERE TERM_STATUS_INDICATOR IN ('P', 'F', 'C')",
 "SELECT FULL_NAME FROM MIT_STUDENT_DIRECTORY WHERE DEPARTMENT = 'MIT'",
 'SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FCLT_BUILDING JOIN FAC_BUILDING_ADDRESS ON FCLT_BUILDING.FCLT_BUILDING_KEY = FAC_BUILDING_ADDRESS.BUILDING_KEY',
 'SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;',
 'SELECT BUILDING_ROOM, COUNT(*) AS ROOM_COUNT FROM FCLT_ROOMS GROUP BY BUILDING_ROOM',
 "SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE='Computer Science'",
 'SELECT DEPARTMENT, COUNT(DISTINCT PAYROLL_RANK) AS RANK_COUNT FROM SE_PERSON GROUP BY DEPARTMENT ORDER BY RANK_COUNT DESC LIMIT 1']

In [158]:
np.mean(np.array(accuracy))

0.6418918918918919

In [169]:
tp = 0 
fp = 0 
fn = 0 
accurate = 0 
for i, t in enumerate(df_q['tables']):
    tp = tp + len(set(t).intersection(tables[i]))
    fn = fn + len(set(t).difference(tables[i]))
    fp = fp + len(set(tables[i]).difference(t))
    accurate = accurate + (1 if set(t) == set(tables[i]) else 0) 
precision = tp / (tp + fp) 
recall = tp / (tp + fn)
accuracy = accurate / len(tables) 
print("precision:{0}".format(precision))
print("recall:{0}".format(recall))
print("f1:{0}".format(2*precision*recall/(precision + recall)))
print("accuracy:{0}".format(accuracy))

precision:0.7446808510638298
recall:0.5932203389830508
f1:0.6603773584905661
accuracy:0.4864864864864865

In [25]:
df_x = pd.read_json('data/queries.json')

In [27]:
df_q['tables_referred']=df_x['tables_referred']

In [31]:
df_q['tables']=df_q['tables_referred']